app/Controllers/Barang.php

    public function simpanbarang()
    {
        $db = \Config\Database::connect();

        // Ambil data dari form
        $data = [
            // idbrg opsional: ikut disimpan jika ada (non-null & non-empty)
            'kodebrg' => $this->request->getPost('kodebrg'),
            'namabrg'    => $this->request->getPost('namabrg'),
            'hargabrg'   => $this->request->getPost('hargabrg'),
            'jumlahbeli '     => $this->request->getPost('jumlahbeli'),
            'diskon'  => $this->request->getPost('diskon'),
            'total'   => $this->request->getPost('total'),
        ];

        // Simpan ke database
        $simpan = $db->table('barang')->insert($data);
---
INSERT INTO `barang` (`kodebrg`, `namabrg`, `hargabrg`, `qty`, `diskon`, `total`) VALUES ('b001', NULL, NULL, '3', '3', '29997')

    public function tampil()
    {
        $db = \Config\Database::connect();

        // Urutkan berdasarkan id barang
        $builder = $db->table('barang');
        $builder->orderBy('kodebrg', 'ASC');
        $query = $builder->get();
---
SELECT *
FROM `barang`
ORDER BY `kodebrg` ASC