app/Controllers/Kamar.php

    public function simpankamar()
    {
        $db = \Config\Database::connect();

        // Ambil data dari form
        $data = [
            'kodekamar' => $this->request->getPost('kodekamar'),
            'namakamar' => $this->request->getPost('namakamar'),
            'harga' => $this->request->getPost('harga'),
            'tglcekin' => $this->request->getPost('tglcekin'),
            'tglcekout' => $this->request->getPost('tglcekout'),
            'lama' => $this->request->getPost('lama'),
            'total' => $this->request->getPost('total'),
        ];

        // Simpan ke database
        $simpan = $db->table('kamar')->insert($data);
---
INSERT INTO `kamar` (`kodekamar`, `namakamar`, `harga`, `tglcekin`, `tglcekout`, `lama`, `total`) VALUES ('k002', 'Anggrek', NULL, '2025-10-09', '2025-10-18', '9', '1800000')

    public function tampil()
    {
        $db = \Config\Database::connect();

        // Urutkan berdasarkan kode kamar
        $builder = $db->table('kamar');
        $builder->orderBy('kodekamar', 'ASC');
        $query = $builder->get();
---
SELECT *
FROM `kamar`
ORDER BY `kodekamar` ASC