app/Controllers/Sppd.php

SELECT *
FROM `tabelsppd`
---
    public function tampil()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tabelsppd');
        $query = $builder->get();